{
  "rating": 0,
  "photo_hash": "85FFDB589FE4A0C6BA382578CE4C835701EDC8E354E044C9A37B62E15731D718",
  "on_favorites": false,
  "photo": "6F34AA5A-2A1D-40D5-9F55-85A821474D06.jpg",
  "uid": "1F5D79CC-2A6D-493A-A1A8-99792DAF2A46",
  "scale": null,
  "ingredients": "For the Crust:\nFor the Crust 2 tsp. granulated sugar\n2 tsp. granulated sugar 1/2 tsp. kosher salt\n1/2 tsp. kosher salt 1 1/4 cups all-purpose flour, plus more for dusting\n1 1/4 cups all-purpose flour, plus more for dusting 1/2 cup (1 stick) unsalted butter, cut into pieces, frozen for 15 minutes\nFor the Filling and Assembly:\nFor the Filling and Assembly 3 cups blanched hazelnuts\n3 cups blanched hazelnuts 4 oz. bittersweet chocolate, chopped\n4 oz. bittersweet chocolate, chopped 6 Tbsp. unsalted butter\n6 Tbsp. unsalted butter 1 cup (packed) light brown sugar\n1 cup (packed) light brown sugar 1 Tbsp. instant espresso powder\n1 Tbsp. instant espresso powder 1 Tbsp. vanilla extract\n1 Tbsp. vanilla extract 1 cup plus 2 Tbsp. light corn syrup\n1 cup plus 2 Tbsp. light corn syrup 1 tsp. kosher salt, divided\n1 tsp. kosher salt, divided 3 large eggs, room temperature, beaten to blend",
  "is_pinned": false,
  "source": "epicurious.com",
  "total_time": "",
  "hash": "53F87F6E7FB3EB16F797E9DB3A8BBAE46EB467C87660071304C04FD53DE84D17",
  "description": "",
  "source_url": "https://www.epicurious.com/recipes/food/views/black-bottom-hazelnut-pie?utm_source=nl&utm_brand=epi&utm_mailing=EPI_CTN_103121_longread&utm_campaign=aud-dev&utm_medium=email&bxid=5ee19c6692bb2f2ece66af79&cndid=41662045&hasha=a97e5b92ec4fccd1d15d68100a1f019d&hashb=8c112f6cb5ad3a55a004071924492aa0a24b3981&hashc=589abf34f6c8f98d56b74cc417538510db1537dd50e8b8f9a189f69d6497aec8&esrc=bouncexmulti_first&utm_content=A&utm_term=EPI_CTN",
  "difficulty": "",
  "on_grocery_list": false,
  "in_trash": false,
  "directions": "Pulse granulated sugar, salt, and 1 1/4 cups flour in a food processor to combine. Add butter and pulse until coarse, pea-size crumbs form, about 10 seconds. With the motor running, add 2 Tbsp. ice water and process until dough just holds together, about 30 seconds. Squeeze a small amount of dough between your fingers: If it’s very crumbly, pulse in more ice water 1 Tbsp. at a time (2 Tbsp. maximum). Do not overprocess.\n\nTurn out dough onto a lightly floured surface and push together into a ball. Knead a few times to combine, then flatten into a disk with smooth edges (no cracks). Cover tightly and chill at least 1 hour.\n\nRoll out dough to a 13\" round on a lightly floured surface. Roll dough loosely around rolling pin and transfer to a standard 9\"-diameter pie dish. Lightly press dough into pan, leaving a 1\" overhang; trim excess. Fold overhang under and crimp as desired. Chill until cold, about 30 minutes.\n\nPlace racks in bottom third and center of oven; preheat to 375°F. Place a rimmed baking sheet on bottom rack to preheat.\n\nSpread hazelnuts on another rimmed baking sheet and bake on center rack until light golden brown, about 10 minutes. Reserve 1 cup whole hazelnuts to decorate pie; finely chop remaining hazelnuts.\n\nMelt chocolate in a small heatproof bowl set over a small saucepan of barely simmering water (do not let water touch bowl); stir constantly until chocolate is melted and smooth. (You can also do this in a microwave.) Remove from heat and let cool slightly. Spread chocolate in bottom of pie shell with the back of a spoon and chill until set, about 15 minutes.\n\nMelt butter in a small skillet over medium heat or in a microwave in a microwave-safe bowl. Pour butter into a large bowl. Whisk in brown sugar, espresso powder, vanilla, 1 cup corn syrup, and 3/4 tsp. salt until well incorporated. Whisk in eggs, then fold in chopped hazelnuts.\n\nPour filling into pie crust (do not overfill). Toss whole hazelnuts with remaining 2 Tbsp. corn syrup and 1/4 tsp. salt in a small bowl and arrange on top of pie. Place pie dish on preheated baking sheet on bottom rack and bake 20 minutes. Rotate baking sheet, move to center rack, and continue to bake, covering edges with foil or a pie shield if crust starts to brown too much, until crust is golden brown and filling is almost set with a slight jiggle in center of pie, 20–25 minutes more. Transfer pie to a wire rack and let cool before slicing, about 3 hours.",
  "categories": ["Dessert", "{ Untested }"],
  "photo_url": "http://uploads.paprikaapp.com.s3.amazonaws.com/614968/6F34AA5A-2A1D-40D5-9F55-85A821474D06.jpg?Signature=v8bs8x%2FnDa84x06oRgyoBphu19Q%3D&Expires=1637446384&AWSAccessKeyId=AKIAQ656ARCHKEP3RMYH",
  "cook_time": "6 hour 30 minutes",
  "name": "Black-Bottom Hazelnut Pie",
  "created": "2021-11-20 15:49:54",
  "notes": "",
  "photo_large": null,
  "image_url": "https://assets.epicurious.com/photos/5dc1eb005eb0dd0009b00b93/2:1/w_4999,h_2499,c_limit/HazelnutPie_RECIPE_103019_5556.jpg",
  "prep_time": "1 hour",
  "servings": "One 9\" pie",
  "nutritional_info": ""
}
